# Pandas DataFrame OverView

In [43]:
import pandas as pd
import numpy as np

In [2]:
apple=pd.Series([3,2,0,1])
Oranges=pd.Series([3,4,7,8])

In [3]:
data={'apple':apple,'orange':Oranges}

In [4]:
fruits=pd.DataFrame(data)

In [5]:
print(fruits)

   apple  orange
0      3       3
1      2       4
2      0       7
3      1       8

In [6]:
apple=pd.Series([3,2,0,1],['a','b','c','d'])              #index must be same other wise data will be mismanaged
Oranges=pd.Series([3,4,7,8],['mon','tues','wed','thurs'])

In [7]:
data={'apple':apple,'orange':Oranges}

In [8]:
fruits=pd.DataFrame(data)

In [10]:
print(fruits)

       apple  orange
a        3.0     NaN
b        2.0     NaN
c        0.0     NaN
d        1.0     NaN
mon      NaN     3.0
thurs    NaN     8.0
tues     NaN     4.0
wed      NaN     7.0

In [11]:
data={'state':['ohio','ohio','ohio','nevada','nevada','nevada'],
      'year':[2000,2001,2002,2000,2001,2002],
      "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}

In [12]:
state_pop_df=pd.DataFrame(data,index=['1st','2nd','3rd','4th','5th','6th'])

In [13]:
print(state_pop_df)

      state  year  pop
1st    ohio  2000  1.5
2nd    ohio  2001  1.7
3rd    ohio  2002  3.6
4th  nevada  2000  2.4
5th  nevada  2001  2.9
6th  nevada  2002  3.2

In [14]:
state_pop_df=pd.DataFrame(data,columns=['year','state','pop'])

In [21]:
state_pop_df.head()

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2000  nevada  2.4
4  2001  nevada  2.9

In [18]:
state_pop_df.head(2)

   year state  pop
0  2000  ohio  1.5
1  2001  ohio  1.7

In [24]:
state_pop_df=pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])

In [25]:
state_pop_df

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2000  nevada  2.4  NaN
five   2001  nevada  2.9  NaN
six    2002  nevada  3.2  NaN

In [26]:
state_pop_df.tail()

       year   state  pop debt
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2000  nevada  2.4  NaN
five   2001  nevada  2.9  NaN
six    2002  nevada  3.2  NaN

In [28]:
state_pop_df.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [29]:
state_pop_df.state

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [30]:
state_pop_df.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [37]:
state_pop_df['debt']=10

In [38]:
state_pop_df.head()

       year   state  pop  debt
one    2000    ohio  1.5    10
two    2001    ohio  1.7    10
three  2002    ohio  3.6    10
four   2000  nevada  2.4    10
five   2001  nevada  2.9    10

In [39]:
state_pop_df['debt']=[10,1,3,45,6,7]

In [40]:
state_pop_df

       year   state  pop  debt
one    2000    ohio  1.5    10
two    2001    ohio  1.7     1
three  2002    ohio  3.6     3
four   2000  nevada  2.4    45
five   2001  nevada  2.9     6
six    2002  nevada  3.2     7

In [41]:
ln=len(state_pop_df)

In [42]:
ln

6

In [44]:
rng=np.arange(ln)

In [45]:
rng

array([0, 1, 2, 3, 4, 5])

In [46]:
state_pop_df['debt']=rng

In [47]:
state_pop_df

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2000  nevada  2.4     3
five   2001  nevada  2.9     4
six    2002  nevada  3.2     5

In [57]:
obj=pd.Series(['blue','purple','yellow'],index=[0,3,6])

In [58]:
print(obj)

0      blue
3    purple
6    yellow
dtype: object

In [59]:
#obj=obj.reindex(range(9))
#print(obj)

In [60]:
obj=obj.reindex(range(9),method="ffill")
print(obj)

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [63]:
obj=obj.reindex(range(9),method="bfill")

In [64]:
obj

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [68]:
obj=obj.reindex(range(2,11),method="bfill")

In [71]:
obj

2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9        NaN
10       NaN
dtype: object

In [80]:
state=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                   columns=['ohio','texas','california'])
print(state)

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [81]:
state=state.reindex(['a','b','c','d'],method='ffill')

In [82]:
state

   ohio  texas  california
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [83]:
state_name=["texas",'útah','california','ohio']

In [84]:
state=state.reindex(columns=state_name)

In [85]:
print(state)

   texas  útah  california  ohio
a      1   NaN           2     0
b      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6

In [88]:
data_df=pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['ohio','colorado','utah','newyork'],
                    columns=['one','two','three','four'])

In [89]:
data_df

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

In [91]:
data_df=pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['ohio','colorado','utah','newyork'],
                    columns=['one','two','three','four'])
print(data_df,"\n")

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15

ModuleNotFoundError: No module named 'cv'

ModuleNotFoundError: No module named 'cv2'